import { Card, Typography } from "@mui/material";

export default () => {
  return (
    <div style={{ width: "100%", textAlign: "center" }}>
      <Card
        style={{
          margin: 24,
          marginBottom: 24,
          borderRadius: 4,
          display: "inline-block",
          textAlign: "center",
          maxWidth: 800,
          padding: 24,
        }}
      >
        <Typography variant="h5">درباره ما</Typography>

        <Typography textAlign="right" padding={1} variant="body1">
          یک متن که قرار است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار
          است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار است انقدر طولانی
          باشد تا چندین خط شود. یک متن که قرار است انقدر طولانی باشد تا چندین خط
          شود. یک متن که قرار است انقدر طولانی باشد تا چندین خط شود یک متن که
          قرار است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار است انقدر
          طولانی باشد تا چندین خط شود. یک متن که قرار است انقدر طولانی باشد تا
          چندین خط شود. یک متن که قرار است انقدر طولانی باشد تا چندین خط شود. یک
          متن که قرار است انقدر طولانی باشد تا چندین خط شود
        </Typography>

        <Typography textAlign="right" padding={1} variant="body1">
          یک متن که قرار است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار
          است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار است انقدر طولانی
          باشد تا چندین خط شود. یک متن که قرار است انقدر طولانی باشد تا چندین خط
          شود. یک متن که قرار است انقدر طولانی باشد تا چندین خط شود یک متن که
          قرار است انقدر طولانی باشد تا چندین خط شود. یک متن که قرار است انقدر
          طولانی باشد تا چندین خط شود.
        </Typography>
      </Card>
    </div>
  );
};
